#20170661 조진우
'''
군대에서 C언어를 독학해본 적이 있습니다.
2020 겨울학기에 고급응용C프로그래밍 수강했습니다.
그 이후에 C의 기본적인 문법과 정렬, 스택, 큐를 공부해보았습니다.
'''

print("Hello World") #문자열 출력
print(2+3) #계산결과 출력 : 5
print(54-50) #계산결과 출력 : 4
print(5*15) #계산결과 출력 : 75
print(8/4) #계산결과 출력 : 8/4의 결과 2.0, 정수형으로 출력하고 싶다면 8//4
print(9%4) #계산결과 출력 : 9/4의 나머지 1
print("1+2=", 1+2) #계산결과 출력 : 1+2= 3
print('2+3=',2+3) #계산결과 출력 : 2+3= 5

#Introducing myself
print('교수님, 조교님 반갑습니다.')
print('20170661 경제학과 조진우입니다.')
print('C에서는 일일이 세미콜론도 찍고 따옴표 구분도 잘 했어야 했는데')
print("파이썬은 자료형 선언도 안해도 되고 따옴표도 크게 상관없고 참 친절한 언어군요.")
print("이번 학기 잘 부탁드립니다.")